Autodesk.Revit.DB.MEPModel.ConnectorManager
Retrieves the Connector Manager from this MEPModel.
null if there is no connector manager supported for this MEPModel.

Autodesk.Revit.DB.MEPModel.AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
Remarks: This property returns a set of Electrical Systems. If there are no electrical systems created
for this model, this property will be an empty set.

Autodesk.Revit.DB.MEPModel.ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
Remarks: This property returns a set of Electrical Systems. If there are no electrical systems created
for this model, this property will be an empty set.

Autodesk.Revit.DB.MEPModel
Supports all MEP models that are persistent within the Autodesk Revit project